import { Box, Typography } from "@mui/material";

const AboutTheHotel = () => {
    return (
        <Box sx={{ padding: 4, direction: "rtl" }}>
            {/* כותרת המלון */}
            <Typography variant="h3" sx={{ textAlign: "center", color: "#b88a4b", fontWeight: "bold", mb: 3 }}>
                King Solomon
            </Typography>

            {/* הטקסט של המלון */}
            <Typography variant="h5" sx={{ textAlign: "right", color: "#8d6748",fontFamily:"Segoe UI", lineHeight: 1.8 }}>
                ברוכים הבאים למלון שלנו<br></br> מקום שבו כל פרט נבחר בקפידה כדי להעניק לכם חוויית אירוח בלתי נשכחת.
                המלון ממוקם בלב גאורגיה, ומציע לאורחיו שלל אטרקציות ופעילויות ייחודיות. אם אתם חובבי טיולים,
                תוכלו להנות מהמסלולים המדהימים שמסביב למלון, כולל מסעות רגליים, רכיבה על סוסים וטיולים באתרים ההיסטוריים של האזור.
                בנוסף, אנו מציעים טיולים מודרכים למקומות מעניינים כמו הרים, אגמים, ושמורות טבע.
            </Typography>

            <Typography variant="h5" sx={{ textAlign: "right", color: "#8d6748",fontFamily:"Segoe UI", lineHeight: 1.8, mt: 2 }}>
                במלון תוכלו להירגע ולהתפנק בעיסויים בספא, להנות בבריכה המחוממת או לשמור על כושר במרכז הספורט המתקדם שלנו.
                החדרים מצוידים בריהוט יוקרתי, עם נוף עוצר נשימה והכול כדי שתהנו משקט ושלווה. אנחנו גם מציעים מבחר ארוחות עשירות ומגוונות –
                ארוחות בוקר עשירות, ארוחות צהריים וערב עם מנות גאורגיות אותנטיות, כולל מאכלים מקומיים טריים וטעימים.
            </Typography>

            <Typography variant="h5" sx={{ textAlign: "right", color: "#8d6748",fontFamily:"Segoe UI", lineHeight: 1.8, mt: 2 }}>
                כל ארוחה תהפוך את חווית האירוח שלכם למפגש עם תרבות גאורגית אמיתית. כל פרט במלון שלנו נבחר על מנת לספק לכם חוויית אירוח מושלמת,
                עם שירות אישי ומקצועי שמבטיח שתהיו מרוצים בכל רגע. השהות אצלנו תספק לכם את כל מה שדרוש להירגע, להתפנק ולגלות את קסמיה של גאורגיה.
            </Typography>
        </Box>
    );
};

export default AboutTheHotel;
